# Module 02

## Session 02 Python for Data Analysis

# Pandas Operation

In [1]:
import pandas as pd

## Function

In [2]:
df = pd.DataFrame(
    {
        'col1':[1,2,3,4],
        'col2':[444,555,666,777],
        'col3':['abc','def','ghi','xyz']
    }
)

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [4]:
def times2(x):
    return x*2

In [5]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [6]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [7]:
len(df['col3'])

4

In [8]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [9]:
df['col3'].apply(lambda x: x[1])

0    b
1    e
2    h
3    y
Name: col3, dtype: object

In [10]:
df['col3'].apply(lambda x: len(x))

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

## Arithmetic Operation

In [11]:
df['col4'] = df['col1'] + df['col2']
df

   col1  col2 col3  col4
0     1   444  abc   445
1     2   555  def   557
2     3   666  ghi   669
3     4   777  xyz   781

In [12]:
df['col5'] = df['col1'] - df['col2']
df

   col1  col2 col3  col4  col5
0     1   444  abc   445  -443
1     2   555  def   557  -553
2     3   666  ghi   669  -663
3     4   777  xyz   781  -773

In [13]:
df['col6'] = df['col2'] / df['col1']
df

   col1  col2 col3  col4  col5    col6
0     1   444  abc   445  -443  444.00
1     2   555  def   557  -553  277.50
2     3   666  ghi   669  -663  222.00
3     4   777  xyz   781  -773  194.25

In [14]:
df['col7'] = df['col1'] * df['col1']
df

   col1  col2 col3  col4  col5    col6  col7
0     1   444  abc   445  -443  444.00     1
1     2   555  def   557  -553  277.50     4
2     3   666  ghi   669  -663  222.00     9
3     4   777  xyz   781  -773  194.25    16

## Pivot Table

In [15]:
data = {
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one', 'one'],
    'C':['x','y','x','y','x', 'y'],
    'D':[1,3,2,5,4,1]
}

In [17]:
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [18]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN